---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Parameter Properties
Parameter Class See Also Send Feedback
---

The Parameter type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Definition | Returns the Definition object that describes the data type, name and other details of the parameter. |
|  | Element | The element to which this parameter belongs. |
|  | GUID | The Guid for a shared parameter. |
|  | HasValue | Identifies if the parameter has an assigned value. |
|  | Id | The id of the parameter. |
|  | IsReadOnly | Get the readonly property of the parameter. (Overrides APIObject..::..IsReadOnly.) |
|  | IsShared | Identifies if the parameter is a shared parameter. |
|  | StorageType | Describes the type that is used internally within the parameter to store its value. |
|  | UserModifiable | Indicates whether the interactive user can modify the value of this parameter. |

# See Also

Parameter Class

Autodesk.Revit.DB Namespace